Revit 2026 API

# ParameterFilterRuleFactory Properties

---

The ParameterFilterRuleFactory type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

ParameterFilterRuleFactory Class

Autodesk.Revit.DB Namespace